      ******************************************************************
      * COPYBOOK  : TEST.cpy
      * PURPOSE   : Record layout for ACS Billing Detail input file
      * AUTHOR    : Billing Team
      * DATE      : 2026-05-06
      ******************************************************************
       01  ACS-BILL-DETAIL-RECORD.
           05  ACS-DETAIL-ACCOUNT       PIC 9(15).
           05  ACS-DETAIL-ELEMENT-ID    PIC X(08).
           05  ACS-DETAIL-VOLUME        PIC 9(08).
           05  ACS-DETAIL-DATE          PIC X(10).
      ******************************************************************
      * END OF COPYBOOK TEST.cpy
      ******************************************************************
